grevaillot/svd_tools/headers/ATSAMV71Q21/pioe.h
/** PIOE_PIO_IER_P31 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P31		(1 << 31)
/** PIOE_PIO_IER_P30 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P30		(1 << 30)
/** PIOE_PIO_IER_P29 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P29		(1 << 29)
/** PIOE_PIO_IER_P28 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P28		(1 << 28)
/** PIOE_PIO_IER_P27 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P27		(1 << 27)
/** PIOE_PIO_IER_P26 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P26		(1 << 26)
/** PIOE_PIO_IER_P25 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P25		(1 << 25)
/** PIOE_PIO_IER_P24 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P24		(1 << 24)
/** PIOE_PIO_IER_P23 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P23		(1 << 23)
/** PIOE_PIO_IER_P22 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P22		(1 << 22)
/** PIOE_PIO_IER_P21 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P21		(1 << 21)
/** PIOE_PIO_IER_P20 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P20		(1 << 20)
/** PIOE_PIO_IER_P19 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P19		(1 << 19)
/** PIOE_PIO_IER_P18 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P18		(1 << 18)
/** PIOE_PIO_IER_P17 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P17		(1 << 17)
/** PIOE_PIO_IER_P16 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P16		(1 << 16)
/** PIOE_PIO_IER_P15 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P15		(1 << 15)
/** PIOE_PIO_IER_P14 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P14		(1 << 14)
/** PIOE_PIO_IER_P13 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P13		(1 << 13)
/** PIOE_PIO_IER_P12 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P12		(1 << 12)
/** PIOE_PIO_IER_P11 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P11		(1 << 11)
/** PIOE_PIO_IER_P10 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P10		(1 << 10)
/** PIOE_PIO_IER_P9 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P9		(1 << 9)
/** PIOE_PIO_IER_P8 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P8		(1 << 8)
/** PIOE_PIO_IER_P7 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P7		(1 << 7)
/** PIOE_PIO_IER_P6 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P6		(1 << 6)
/** PIOE_PIO_IER_P5 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P5		(1 << 5)
/** PIOE_PIO_IER_P4 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P4		(1 << 4)
/** PIOE_PIO_IER_P3 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P3		(1 << 3)
/** PIOE_PIO_IER_P2 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P2		(1 << 2)
/** PIOE_PIO_IER_P1 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P1		(1 << 1)
/** PIOE_PIO_IER_P0 Input Change Interrupt Enable **/
#define PIOE_PIO_IER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_idr PIOIDR Interrupt Disable Register
@{*/

/** PIOE_PIO_IDR_P31 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P31		(1 << 31)
/** PIOE_PIO_IDR_P30 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P30		(1 << 30)
/** PIOE_PIO_IDR_P29 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P29		(1 << 29)
/** PIOE_PIO_IDR_P28 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P28		(1 << 28)
/** PIOE_PIO_IDR_P27 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P27		(1 << 27)
/** PIOE_PIO_IDR_P26 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P26		(1 << 26)
/** PIOE_PIO_IDR_P25 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P25		(1 << 25)
/** PIOE_PIO_IDR_P24 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P24		(1 << 24)
/** PIOE_PIO_IDR_P23 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P23		(1 << 23)
/** PIOE_PIO_IDR_P22 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P22		(1 << 22)
/** PIOE_PIO_IDR_P21 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P21		(1 << 21)
/** PIOE_PIO_IDR_P20 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P20		(1 << 20)
/** PIOE_PIO_IDR_P19 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P19		(1 << 19)
/** PIOE_PIO_IDR_P18 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P18		(1 << 18)
/** PIOE_PIO_IDR_P17 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P17		(1 << 17)
/** PIOE_PIO_IDR_P16 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P16		(1 << 16)
/** PIOE_PIO_IDR_P15 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P15		(1 << 15)
/** PIOE_PIO_IDR_P14 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P14		(1 << 14)
/** PIOE_PIO_IDR_P13 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P13		(1 << 13)
/** PIOE_PIO_IDR_P12 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P12		(1 << 12)
/** PIOE_PIO_IDR_P11 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P11		(1 << 11)
/** PIOE_PIO_IDR_P10 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P10		(1 << 10)
/** PIOE_PIO_IDR_P9 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P9		(1 << 9)
/** PIOE_PIO_IDR_P8 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P8		(1 << 8)
/** PIOE_PIO_IDR_P7 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P7		(1 << 7)
/** PIOE_PIO_IDR_P6 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P6		(1 << 6)
/** PIOE_PIO_IDR_P5 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P5		(1 << 5)
/** PIOE_PIO_IDR_P4 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P4		(1 << 4)
/** PIOE_PIO_IDR_P3 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P3		(1 << 3)
/** PIOE_PIO_IDR_P2 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P2		(1 << 2)
/** PIOE_PIO_IDR_P1 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P1		(1 << 1)
/** PIOE_PIO_IDR_P0 Input Change Interrupt Disable **/
#define PIOE_PIO_IDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_imr PIOIMR Interrupt Mask Register
@{*/

/** PIOE_PIO_IMR_P31 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P31		(1 << 31)
/** PIOE_PIO_IMR_P30 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P30		(1 << 30)
/** PIOE_PIO_IMR_P29 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P29		(1 << 29)
/** PIOE_PIO_IMR_P28 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P28		(1 << 28)
/** PIOE_PIO_IMR_P27 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P27		(1 << 27)
/** PIOE_PIO_IMR_P26 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P26		(1 << 26)
/** PIOE_PIO_IMR_P25 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P25		(1 << 25)
/** PIOE_PIO_IMR_P24 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P24		(1 << 24)
/** PIOE_PIO_IMR_P23 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P23		(1 << 23)
/** PIOE_PIO_IMR_P22 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P22		(1 << 22)
/** PIOE_PIO_IMR_P21 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P21		(1 << 21)
/** PIOE_PIO_IMR_P20 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P20		(1 << 20)
/** PIOE_PIO_IMR_P19 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P19		(1 << 19)
/** PIOE_PIO_IMR_P18 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P18		(1 << 18)
/** PIOE_PIO_IMR_P17 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P17		(1 << 17)
/** PIOE_PIO_IMR_P16 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P16		(1 << 16)
/** PIOE_PIO_IMR_P15 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P15		(1 << 15)
/** PIOE_PIO_IMR_P14 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P14		(1 << 14)
/** PIOE_PIO_IMR_P13 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P13		(1 << 13)
/** PIOE_PIO_IMR_P12 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P12		(1 << 12)
/** PIOE_PIO_IMR_P11 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P11		(1 << 11)
/** PIOE_PIO_IMR_P10 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P10		(1 << 10)
/** PIOE_PIO_IMR_P9 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P9		(1 << 9)
/** PIOE_PIO_IMR_P8 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P8		(1 << 8)
/** PIOE_PIO_IMR_P7 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P7		(1 << 7)
/** PIOE_PIO_IMR_P6 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P6		(1 << 6)
/** PIOE_PIO_IMR_P5 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P5		(1 << 5)
/** PIOE_PIO_IMR_P4 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P4		(1 << 4)
/** PIOE_PIO_IMR_P3 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P3		(1 << 3)
/** PIOE_PIO_IMR_P2 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P2		(1 << 2)
/** PIOE_PIO_IMR_P1 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P1		(1 << 1)
/** PIOE_PIO_IMR_P0 Input Change Interrupt Mask **/
#define PIOE_PIO_IMR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_isr PIOISR Interrupt Status Register
@{*/

/** PIOE_PIO_ISR_P31 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P31		(1 << 31)
/** PIOE_PIO_ISR_P30 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P30		(1 << 30)
/** PIOE_PIO_ISR_P29 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P29		(1 << 29)
/** PIOE_PIO_ISR_P28 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P28		(1 << 28)
/** PIOE_PIO_ISR_P27 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P27		(1 << 27)
/** PIOE_PIO_ISR_P26 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P26		(1 << 26)
/** PIOE_PIO_ISR_P25 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P25		(1 << 25)
/** PIOE_PIO_ISR_P24 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P24		(1 << 24)
/** PIOE_PIO_ISR_P23 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P23		(1 << 23)
/** PIOE_PIO_ISR_P22 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P22		(1 << 22)
/** PIOE_PIO_ISR_P21 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P21		(1 << 21)
/** PIOE_PIO_ISR_P20 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P20		(1 << 20)
/** PIOE_PIO_ISR_P19 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P19		(1 << 19)
/** PIOE_PIO_ISR_P18 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P18		(1 << 18)
/** PIOE_PIO_ISR_P17 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P17		(1 << 17)
/** PIOE_PIO_ISR_P16 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P16		(1 << 16)
/** PIOE_PIO_ISR_P15 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P15		(1 << 15)
/** PIOE_PIO_ISR_P14 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P14		(1 << 14)
/** PIOE_PIO_ISR_P13 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P13		(1 << 13)
/** PIOE_PIO_ISR_P12 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P12		(1 << 12)
/** PIOE_PIO_ISR_P11 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P11		(1 << 11)
/** PIOE_PIO_ISR_P10 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P10		(1 << 10)
/** PIOE_PIO_ISR_P9 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P9		(1 << 9)
/** PIOE_PIO_ISR_P8 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P8		(1 << 8)
/** PIOE_PIO_ISR_P7 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P7		(1 << 7)
/** PIOE_PIO_ISR_P6 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P6		(1 << 6)
/** PIOE_PIO_ISR_P5 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P5		(1 << 5)
/** PIOE_PIO_ISR_P4 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P4		(1 << 4)
/** PIOE_PIO_ISR_P3 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P3		(1 << 3)
/** PIOE_PIO_ISR_P2 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P2		(1 << 2)
/** PIOE_PIO_ISR_P1 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P1		(1 << 1)
/** PIOE_PIO_ISR_P0 Input Change Interrupt Status **/
#define PIOE_PIO_ISR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_mder PIOMDER Multi-driver Enable Register
@{*/

/** PIOE_PIO_MDER_P31 Multi-drive Enable **/
#define PIOE_PIO_MDER_P31		(1 << 31)
/** PIOE_PIO_MDER_P30 Multi-drive Enable **/
#define PIOE_PIO_MDER_P30		(1 << 30)
/** PIOE_PIO_MDER_P29 Multi-drive Enable **/
#define PIOE_PIO_MDER_P29		(1 << 29)
/** PIOE_PIO_MDER_P28 Multi-drive Enable **/
#define PIOE_PIO_MDER_P28		(1 << 28)
/** PIOE_PIO_MDER_P27 Multi-drive Enable **/
#define PIOE_PIO_MDER_P27		(1 << 27)
/** PIOE_PIO_MDER_P26 Multi-drive Enable **/
#define PIOE_PIO_MDER_P26		(1 << 26)
/** PIOE_PIO_MDER_P25 Multi-drive Enable **/
#define PIOE_PIO_MDER_P25		(1 << 25)
/** PIOE_PIO_MDER_P24 Multi-drive Enable **/
#define PIOE_PIO_MDER_P24		(1 << 24)
/** PIOE_PIO_MDER_P23 Multi-drive Enable **/
#define PIOE_PIO_MDER_P23		(1 << 23)
/** PIOE_PIO_MDER_P22 Multi-drive Enable **/
#define PIOE_PIO_MDER_P22		(1 << 22)
/** PIOE_PIO_MDER_P21 Multi-drive Enable **/
#define PIOE_PIO_MDER_P21		(1 << 21)
/** PIOE_PIO_MDER_P20 Multi-drive Enable **/
#define PIOE_PIO_MDER_P20		(1 << 20)
/** PIOE_PIO_MDER_P19 Multi-drive Enable **/
#define PIOE_PIO_MDER_P19		(1 << 19)
/** PIOE_PIO_MDER_P18 Multi-drive Enable **/
#define PIOE_PIO_MDER_P18		(1 << 18)
/** PIOE_PIO_MDER_P17 Multi-drive Enable **/
#define PIOE_PIO_MDER_P17		(1 << 17)
/** PIOE_PIO_MDER_P16 Multi-drive Enable **/
#define PIOE_PIO_MDER_P16		(1 << 16)
/** PIOE_PIO_MDER_P15 Multi-drive Enable **/
#define PIOE_PIO_MDER_P15		(1 << 15)
/** PIOE_PIO_MDER_P14 Multi-drive Enable **/
#define PIOE_PIO_MDER_P14		(1 << 14)
/** PIOE_PIO_MDER_P13 Multi-drive Enable **/
#define PIOE_PIO_MDER_P13		(1 << 13)
/** PIOE_PIO_MDER_P12 Multi-drive Enable **/
#define PIOE_PIO_MDER_P12		(1 << 12)
/** PIOE_PIO_MDER_P11 Multi-drive Enable **/
#define PIOE_PIO_MDER_P11		(1 << 11)
/** PIOE_PIO_MDER_P10 Multi-drive Enable **/
#define PIOE_PIO_MDER_P10		(1 << 10)
/** PIOE_PIO_MDER_P9 Multi-drive Enable **/
#define PIOE_PIO_MDER_P9		(1 << 9)
/** PIOE_PIO_MDER_P8 Multi-drive Enable **/
#define PIOE_PIO_MDER_P8		(1 << 8)
/** PIOE_PIO_MDER_P7 Multi-drive Enable **/
#define PIOE_PIO_MDER_P7		(1 << 7)
/** PIOE_PIO_MDER_P6 Multi-drive Enable **/
#define PIOE_PIO_MDER_P6		(1 << 6)
/** PIOE_PIO_MDER_P5 Multi-drive Enable **/
#define PIOE_PIO_MDER_P5		(1 << 5)
/** PIOE_PIO_MDER_P4 Multi-drive Enable **/
#define PIOE_PIO_MDER_P4		(1 << 4)
/** PIOE_PIO_MDER_P3 Multi-drive Enable **/
#define PIOE_PIO_MDER_P3		(1 << 3)
/** PIOE_PIO_MDER_P2 Multi-drive Enable **/
#define PIOE_PIO_MDER_P2		(1 << 2)
/** PIOE_PIO_MDER_P1 Multi-drive Enable **/
#define PIOE_PIO_MDER_P1		(1 << 1)
/** PIOE_PIO_MDER_P0 Multi-drive Enable **/
#define PIOE_PIO_MDER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_mddr PIOMDDR Multi-driver Disable Register
@{*/

/** PIOE_PIO_MDDR_P31 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P31		(1 << 31)
/** PIOE_PIO_MDDR_P30 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P30		(1 << 30)
/** PIOE_PIO_MDDR_P29 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P29		(1 << 29)
/** PIOE_PIO_MDDR_P28 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P28		(1 << 28)
/** PIOE_PIO_MDDR_P27 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P27		(1 << 27)
/** PIOE_PIO_MDDR_P26 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P26		(1 << 26)
/** PIOE_PIO_MDDR_P25 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P25		(1 << 25)
/** PIOE_PIO_MDDR_P24 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P24		(1 << 24)
/** PIOE_PIO_MDDR_P23 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P23		(1 << 23)
/** PIOE_PIO_MDDR_P22 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P22		(1 << 22)
/** PIOE_PIO_MDDR_P21 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P21		(1 << 21)
/** PIOE_PIO_MDDR_P20 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P20		(1 << 20)
/** PIOE_PIO_MDDR_P19 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P19		(1 << 19)
/** PIOE_PIO_MDDR_P18 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P18		(1 << 18)
/** PIOE_PIO_MDDR_P17 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P17		(1 << 17)
/** PIOE_PIO_MDDR_P16 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P16		(1 << 16)
/** PIOE_PIO_MDDR_P15 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P15		(1 << 15)
/** PIOE_PIO_MDDR_P14 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P14		(1 << 14)
/** PIOE_PIO_MDDR_P13 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P13		(1 << 13)
/** PIOE_PIO_MDDR_P12 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P12		(1 << 12)
/** PIOE_PIO_MDDR_P11 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P11		(1 << 11)
/** PIOE_PIO_MDDR_P10 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P10		(1 << 10)
/** PIOE_PIO_MDDR_P9 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P9		(1 << 9)
/** PIOE_PIO_MDDR_P8 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P8		(1 << 8)
/** PIOE_PIO_MDDR_P7 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P7		(1 << 7)
/** PIOE_PIO_MDDR_P6 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P6		(1 << 6)
/** PIOE_PIO_MDDR_P5 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P5		(1 << 5)
/** PIOE_PIO_MDDR_P4 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P4		(1 << 4)
/** PIOE_PIO_MDDR_P3 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P3		(1 << 3)
/** PIOE_PIO_MDDR_P2 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P2		(1 << 2)
/** PIOE_PIO_MDDR_P1 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P1		(1 << 1)
/** PIOE_PIO_MDDR_P0 Multi-drive Disable **/
#define PIOE_PIO_MDDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_mdsr PIOMDSR Multi-driver Status Register
@{*/

/** PIOE_PIO_MDSR_P31 Multi-drive Status **/
#define PIOE_PIO_MDSR_P31		(1 << 31)
/** PIOE_PIO_MDSR_P30 Multi-drive Status **/
#define PIOE_PIO_MDSR_P30		(1 << 30)
/** PIOE_PIO_MDSR_P29 Multi-drive Status **/
#define PIOE_PIO_MDSR_P29		(1 << 29)
/** PIOE_PIO_MDSR_P28 Multi-drive Status **/
#define PIOE_PIO_MDSR_P28		(1 << 28)
/** PIOE_PIO_MDSR_P27 Multi-drive Status **/
#define PIOE_PIO_MDSR_P27		(1 << 27)
/** PIOE_PIO_MDSR_P26 Multi-drive Status **/
#define PIOE_PIO_MDSR_P26		(1 << 26)
/** PIOE_PIO_MDSR_P25 Multi-drive Status **/
#define PIOE_PIO_MDSR_P25		(1 << 25)
/** PIOE_PIO_MDSR_P24 Multi-drive Status **/
#define PIOE_PIO_MDSR_P24		(1 << 24)
/** PIOE_PIO_MDSR_P23 Multi-drive Status **/
#define PIOE_PIO_MDSR_P23		(1 << 23)
/** PIOE_PIO_MDSR_P22 Multi-drive Status **/
#define PIOE_PIO_MDSR_P22		(1 << 22)
/** PIOE_PIO_MDSR_P21 Multi-drive Status **/
#define PIOE_PIO_MDSR_P21		(1 << 21)
/** PIOE_PIO_MDSR_P20 Multi-drive Status **/
#define PIOE_PIO_MDSR_P20		(1 << 20)
/** PIOE_PIO_MDSR_P19 Multi-drive Status **/
#define PIOE_PIO_MDSR_P19		(1 << 19)
/** PIOE_PIO_MDSR_P18 Multi-drive Status **/
#define PIOE_PIO_MDSR_P18		(1 << 18)
/** PIOE_PIO_MDSR_P17 Multi-drive Status **/
#define PIOE_PIO_MDSR_P17		(1 << 17)
/** PIOE_PIO_MDSR_P16 Multi-drive Status **/
#define PIOE_PIO_MDSR_P16		(1 << 16)
/** PIOE_PIO_MDSR_P15 Multi-drive Status **/
#define PIOE_PIO_MDSR_P15		(1 << 15)
/** PIOE_PIO_MDSR_P14 Multi-drive Status **/
#define PIOE_PIO_MDSR_P14		(1 << 14)
/** PIOE_PIO_MDSR_P13 Multi-drive Status **/
#define PIOE_PIO_MDSR_P13		(1 << 13)
/** PIOE_PIO_MDSR_P12 Multi-drive Status **/
#define PIOE_PIO_MDSR_P12		(1 << 12)
/** PIOE_PIO_MDSR_P11 Multi-drive Status **/
#define PIOE_PIO_MDSR_P11		(1 << 11)
/** PIOE_PIO_MDSR_P10 Multi-drive Status **/
#define PIOE_PIO_MDSR_P10		(1 << 10)
/** PIOE_PIO_MDSR_P9 Multi-drive Status **/
#define PIOE_PIO_MDSR_P9		(1 << 9)
/** PIOE_PIO_MDSR_P8 Multi-drive Status **/
#define PIOE_PIO_MDSR_P8		(1 << 8)
/** PIOE_PIO_MDSR_P7 Multi-drive Status **/
#define PIOE_PIO_MDSR_P7		(1 << 7)
/** PIOE_PIO_MDSR_P6 Multi-drive Status **/
#define PIOE_PIO_MDSR_P6		(1 << 6)
/** PIOE_PIO_MDSR_P5 Multi-drive Status **/
#define PIOE_PIO_MDSR_P5		(1 << 5)
/** PIOE_PIO_MDSR_P4 Multi-drive Status **/
#define PIOE_PIO_MDSR_P4		(1 << 4)
/** PIOE_PIO_MDSR_P3 Multi-drive Status **/
#define PIOE_PIO_MDSR_P3		(1 << 3)
/** PIOE_PIO_MDSR_P2 Multi-drive Status **/
#define PIOE_PIO_MDSR_P2		(1 << 2)
/** PIOE_PIO_MDSR_P1 Multi-drive Status **/
#define PIOE_PIO_MDSR_P1		(1 << 1)
/** PIOE_PIO_MDSR_P0 Multi-drive Status **/
#define PIOE_PIO_MDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pudr PIOPUDR Pull-up Disable Register
@{*/

/** PIOE_PIO_PUDR_P31 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P31		(1 << 31)
/** PIOE_PIO_PUDR_P30 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P30		(1 << 30)
/** PIOE_PIO_PUDR_P29 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P29		(1 << 29)
/** PIOE_PIO_PUDR_P28 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P28		(1 << 28)
/** PIOE_PIO_PUDR_P27 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P27		(1 << 27)
/** PIOE_PIO_PUDR_P26 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P26		(1 << 26)
/** PIOE_PIO_PUDR_P25 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P25		(1 << 25)
/** PIOE_PIO_PUDR_P24 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P24		(1 << 24)
/** PIOE_PIO_PUDR_P23 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P23		(1 << 23)
/** PIOE_PIO_PUDR_P22 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P22		(1 << 22)
/** PIOE_PIO_PUDR_P21 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P21		(1 << 21)
/** PIOE_PIO_PUDR_P20 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P20		(1 << 20)
/** PIOE_PIO_PUDR_P19 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P19		(1 << 19)
/** PIOE_PIO_PUDR_P18 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P18		(1 << 18)
/** PIOE_PIO_PUDR_P17 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P17		(1 << 17)
/** PIOE_PIO_PUDR_P16 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P16		(1 << 16)
/** PIOE_PIO_PUDR_P15 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P15		(1 << 15)
/** PIOE_PIO_PUDR_P14 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P14		(1 << 14)
/** PIOE_PIO_PUDR_P13 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P13		(1 << 13)
/** PIOE_PIO_PUDR_P12 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P12		(1 << 12)
/** PIOE_PIO_PUDR_P11 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P11		(1 << 11)
/** PIOE_PIO_PUDR_P10 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P10		(1 << 10)
/** PIOE_PIO_PUDR_P9 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P9		(1 << 9)
/** PIOE_PIO_PUDR_P8 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P8		(1 << 8)
/** PIOE_PIO_PUDR_P7 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P7		(1 << 7)
/** PIOE_PIO_PUDR_P6 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P6		(1 << 6)
/** PIOE_PIO_PUDR_P5 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P5		(1 << 5)
/** PIOE_PIO_PUDR_P4 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P4		(1 << 4)
/** PIOE_PIO_PUDR_P3 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P3		(1 << 3)
/** PIOE_PIO_PUDR_P2 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P2		(1 << 2)
/** PIOE_PIO_PUDR_P1 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P1		(1 << 1)
/** PIOE_PIO_PUDR_P0 Pull-Up Disable **/
#define PIOE_PIO_PUDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_puer PIOPUER Pull-up Enable Register
@{*/

