grevaillot/svd_tools/headers/ATSAMV71Q21/pioe.h
/** @defgroup pioe_pio_ifscer PIOIFSCER Input Filter Slow Clock Enable Register
@{*/

/** PIOE_PIO_IFSCER_P31 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P31		(1 << 31)
/** PIOE_PIO_IFSCER_P30 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P30		(1 << 30)
/** PIOE_PIO_IFSCER_P29 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P29		(1 << 29)
/** PIOE_PIO_IFSCER_P28 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P28		(1 << 28)
/** PIOE_PIO_IFSCER_P27 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P27		(1 << 27)
/** PIOE_PIO_IFSCER_P26 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P26		(1 << 26)
/** PIOE_PIO_IFSCER_P25 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P25		(1 << 25)
/** PIOE_PIO_IFSCER_P24 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P24		(1 << 24)
/** PIOE_PIO_IFSCER_P23 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P23		(1 << 23)
/** PIOE_PIO_IFSCER_P22 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P22		(1 << 22)
/** PIOE_PIO_IFSCER_P21 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P21		(1 << 21)
/** PIOE_PIO_IFSCER_P20 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P20		(1 << 20)
/** PIOE_PIO_IFSCER_P19 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P19		(1 << 19)
/** PIOE_PIO_IFSCER_P18 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P18		(1 << 18)
/** PIOE_PIO_IFSCER_P17 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P17		(1 << 17)
/** PIOE_PIO_IFSCER_P16 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P16		(1 << 16)
/** PIOE_PIO_IFSCER_P15 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P15		(1 << 15)
/** PIOE_PIO_IFSCER_P14 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P14		(1 << 14)
/** PIOE_PIO_IFSCER_P13 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P13		(1 << 13)
/** PIOE_PIO_IFSCER_P12 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P12		(1 << 12)
/** PIOE_PIO_IFSCER_P11 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P11		(1 << 11)
/** PIOE_PIO_IFSCER_P10 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P10		(1 << 10)
/** PIOE_PIO_IFSCER_P9 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P9		(1 << 9)
/** PIOE_PIO_IFSCER_P8 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P8		(1 << 8)
/** PIOE_PIO_IFSCER_P7 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P7		(1 << 7)
/** PIOE_PIO_IFSCER_P6 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P6		(1 << 6)
/** PIOE_PIO_IFSCER_P5 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P5		(1 << 5)
/** PIOE_PIO_IFSCER_P4 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P4		(1 << 4)
/** PIOE_PIO_IFSCER_P3 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P3		(1 << 3)
/** PIOE_PIO_IFSCER_P2 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P2		(1 << 2)
/** PIOE_PIO_IFSCER_P1 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P1		(1 << 1)
/** PIOE_PIO_IFSCER_P0 Slow Clock Debouncing Filtering Select **/
#define PIOE_PIO_IFSCER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_ifscsr PIOIFSCSR Input Filter Slow Clock Status Register
@{*/

/** PIOE_PIO_IFSCSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P31		(1 << 31)
/** PIOE_PIO_IFSCSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P30		(1 << 30)
/** PIOE_PIO_IFSCSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P29		(1 << 29)
/** PIOE_PIO_IFSCSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P28		(1 << 28)
/** PIOE_PIO_IFSCSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P27		(1 << 27)
/** PIOE_PIO_IFSCSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P26		(1 << 26)
/** PIOE_PIO_IFSCSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P25		(1 << 25)
/** PIOE_PIO_IFSCSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P24		(1 << 24)
/** PIOE_PIO_IFSCSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P23		(1 << 23)
/** PIOE_PIO_IFSCSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P22		(1 << 22)
/** PIOE_PIO_IFSCSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P21		(1 << 21)
/** PIOE_PIO_IFSCSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P20		(1 << 20)
/** PIOE_PIO_IFSCSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P19		(1 << 19)
/** PIOE_PIO_IFSCSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P18		(1 << 18)
/** PIOE_PIO_IFSCSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P17		(1 << 17)
/** PIOE_PIO_IFSCSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P16		(1 << 16)
/** PIOE_PIO_IFSCSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P15		(1 << 15)
/** PIOE_PIO_IFSCSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P14		(1 << 14)
/** PIOE_PIO_IFSCSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P13		(1 << 13)
/** PIOE_PIO_IFSCSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P12		(1 << 12)
/** PIOE_PIO_IFSCSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P11		(1 << 11)
/** PIOE_PIO_IFSCSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P10		(1 << 10)
/** PIOE_PIO_IFSCSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P9		(1 << 9)
/** PIOE_PIO_IFSCSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P8		(1 << 8)
/** PIOE_PIO_IFSCSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P7		(1 << 7)
/** PIOE_PIO_IFSCSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P6		(1 << 6)
/** PIOE_PIO_IFSCSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P5		(1 << 5)
/** PIOE_PIO_IFSCSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P4		(1 << 4)
/** PIOE_PIO_IFSCSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P3		(1 << 3)
/** PIOE_PIO_IFSCSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P2		(1 << 2)
/** PIOE_PIO_IFSCSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P1		(1 << 1)
/** PIOE_PIO_IFSCSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOE_PIO_IFSCSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_scdr PIOSCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOE_PIO_SCDR_DIV_SHIFT		0
#define PIOE_PIO_SCDR_DIV_MASK		0x3fff
/** @defgroup pioe_pio_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

/** @defgroup pioe_pio_ppddr PIOPPDDR Pad Pull-down Disable Register
@{*/

/** PIOE_PIO_PPDDR_P31 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P31		(1 << 31)
/** PIOE_PIO_PPDDR_P30 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P30		(1 << 30)
/** PIOE_PIO_PPDDR_P29 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P29		(1 << 29)
/** PIOE_PIO_PPDDR_P28 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P28		(1 << 28)
/** PIOE_PIO_PPDDR_P27 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P27		(1 << 27)
/** PIOE_PIO_PPDDR_P26 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P26		(1 << 26)
/** PIOE_PIO_PPDDR_P25 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P25		(1 << 25)
/** PIOE_PIO_PPDDR_P24 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P24		(1 << 24)
/** PIOE_PIO_PPDDR_P23 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P23		(1 << 23)
/** PIOE_PIO_PPDDR_P22 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P22		(1 << 22)
/** PIOE_PIO_PPDDR_P21 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P21		(1 << 21)
/** PIOE_PIO_PPDDR_P20 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P20		(1 << 20)
/** PIOE_PIO_PPDDR_P19 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P19		(1 << 19)
/** PIOE_PIO_PPDDR_P18 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P18		(1 << 18)
/** PIOE_PIO_PPDDR_P17 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P17		(1 << 17)
/** PIOE_PIO_PPDDR_P16 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P16		(1 << 16)
/** PIOE_PIO_PPDDR_P15 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P15		(1 << 15)
/** PIOE_PIO_PPDDR_P14 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P14		(1 << 14)
/** PIOE_PIO_PPDDR_P13 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P13		(1 << 13)
/** PIOE_PIO_PPDDR_P12 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P12		(1 << 12)
/** PIOE_PIO_PPDDR_P11 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P11		(1 << 11)
/** PIOE_PIO_PPDDR_P10 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P10		(1 << 10)
/** PIOE_PIO_PPDDR_P9 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P9		(1 << 9)
/** PIOE_PIO_PPDDR_P8 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P8		(1 << 8)
/** PIOE_PIO_PPDDR_P7 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P7		(1 << 7)
/** PIOE_PIO_PPDDR_P6 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P6		(1 << 6)
/** PIOE_PIO_PPDDR_P5 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P5		(1 << 5)
/** PIOE_PIO_PPDDR_P4 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P4		(1 << 4)
/** PIOE_PIO_PPDDR_P3 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P3		(1 << 3)
/** PIOE_PIO_PPDDR_P2 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P2		(1 << 2)
/** PIOE_PIO_PPDDR_P1 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P1		(1 << 1)
/** PIOE_PIO_PPDDR_P0 Pull-Down Disable **/
#define PIOE_PIO_PPDDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_ppder PIOPPDER Pad Pull-down Enable Register
@{*/

/** PIOE_PIO_PPDER_P31 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P31		(1 << 31)
/** PIOE_PIO_PPDER_P30 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P30		(1 << 30)
/** PIOE_PIO_PPDER_P29 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P29		(1 << 29)
/** PIOE_PIO_PPDER_P28 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P28		(1 << 28)
/** PIOE_PIO_PPDER_P27 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P27		(1 << 27)
/** PIOE_PIO_PPDER_P26 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P26		(1 << 26)
/** PIOE_PIO_PPDER_P25 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P25		(1 << 25)
/** PIOE_PIO_PPDER_P24 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P24		(1 << 24)
/** PIOE_PIO_PPDER_P23 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P23		(1 << 23)
/** PIOE_PIO_PPDER_P22 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P22		(1 << 22)
/** PIOE_PIO_PPDER_P21 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P21		(1 << 21)
/** PIOE_PIO_PPDER_P20 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P20		(1 << 20)
/** PIOE_PIO_PPDER_P19 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P19		(1 << 19)
/** PIOE_PIO_PPDER_P18 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P18		(1 << 18)
/** PIOE_PIO_PPDER_P17 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P17		(1 << 17)
/** PIOE_PIO_PPDER_P16 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P16		(1 << 16)
/** PIOE_PIO_PPDER_P15 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P15		(1 << 15)
/** PIOE_PIO_PPDER_P14 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P14		(1 << 14)
/** PIOE_PIO_PPDER_P13 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P13		(1 << 13)
/** PIOE_PIO_PPDER_P12 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P12		(1 << 12)
/** PIOE_PIO_PPDER_P11 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P11		(1 << 11)
/** PIOE_PIO_PPDER_P10 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P10		(1 << 10)
/** PIOE_PIO_PPDER_P9 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P9		(1 << 9)
/** PIOE_PIO_PPDER_P8 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P8		(1 << 8)
/** PIOE_PIO_PPDER_P7 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P7		(1 << 7)
/** PIOE_PIO_PPDER_P6 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P6		(1 << 6)
/** PIOE_PIO_PPDER_P5 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P5		(1 << 5)
/** PIOE_PIO_PPDER_P4 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P4		(1 << 4)
/** PIOE_PIO_PPDER_P3 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P3		(1 << 3)
/** PIOE_PIO_PPDER_P2 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P2		(1 << 2)
/** PIOE_PIO_PPDER_P1 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P1		(1 << 1)
/** PIOE_PIO_PPDER_P0 Pull-Down Enable **/
#define PIOE_PIO_PPDER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_ppdsr PIOPPDSR Pad Pull-down Status Register
@{*/

/** PIOE_PIO_PPDSR_P31 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P31		(1 << 31)
/** PIOE_PIO_PPDSR_P30 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P30		(1 << 30)
/** PIOE_PIO_PPDSR_P29 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P29		(1 << 29)
/** PIOE_PIO_PPDSR_P28 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P28		(1 << 28)
/** PIOE_PIO_PPDSR_P27 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P27		(1 << 27)
/** PIOE_PIO_PPDSR_P26 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P26		(1 << 26)
/** PIOE_PIO_PPDSR_P25 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P25		(1 << 25)
/** PIOE_PIO_PPDSR_P24 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P24		(1 << 24)
/** PIOE_PIO_PPDSR_P23 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P23		(1 << 23)
/** PIOE_PIO_PPDSR_P22 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P22		(1 << 22)
/** PIOE_PIO_PPDSR_P21 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P21		(1 << 21)
/** PIOE_PIO_PPDSR_P20 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P20		(1 << 20)
/** PIOE_PIO_PPDSR_P19 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P19		(1 << 19)
/** PIOE_PIO_PPDSR_P18 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P18		(1 << 18)
/** PIOE_PIO_PPDSR_P17 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P17		(1 << 17)
/** PIOE_PIO_PPDSR_P16 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P16		(1 << 16)
/** PIOE_PIO_PPDSR_P15 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P15		(1 << 15)
/** PIOE_PIO_PPDSR_P14 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P14		(1 << 14)
/** PIOE_PIO_PPDSR_P13 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P13		(1 << 13)
/** PIOE_PIO_PPDSR_P12 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P12		(1 << 12)
/** PIOE_PIO_PPDSR_P11 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P11		(1 << 11)
/** PIOE_PIO_PPDSR_P10 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P10		(1 << 10)
/** PIOE_PIO_PPDSR_P9 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P9		(1 << 9)
/** PIOE_PIO_PPDSR_P8 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P8		(1 << 8)
/** PIOE_PIO_PPDSR_P7 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P7		(1 << 7)
/** PIOE_PIO_PPDSR_P6 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P6		(1 << 6)
/** PIOE_PIO_PPDSR_P5 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P5		(1 << 5)
/** PIOE_PIO_PPDSR_P4 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P4		(1 << 4)
/** PIOE_PIO_PPDSR_P3 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P3		(1 << 3)
/** PIOE_PIO_PPDSR_P2 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P2		(1 << 2)
/** PIOE_PIO_PPDSR_P1 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P1		(1 << 1)
/** PIOE_PIO_PPDSR_P0 Pull-Down Status **/
#define PIOE_PIO_PPDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_ower PIOOWER Output Write Enable
@{*/

/** PIOE_PIO_OWER_P31 Output Write Enable **/
#define PIOE_PIO_OWER_P31		(1 << 31)
/** PIOE_PIO_OWER_P30 Output Write Enable **/
#define PIOE_PIO_OWER_P30		(1 << 30)
/** PIOE_PIO_OWER_P29 Output Write Enable **/
#define PIOE_PIO_OWER_P29		(1 << 29)
/** PIOE_PIO_OWER_P28 Output Write Enable **/
#define PIOE_PIO_OWER_P28		(1 << 28)
/** PIOE_PIO_OWER_P27 Output Write Enable **/
#define PIOE_PIO_OWER_P27		(1 << 27)
/** PIOE_PIO_OWER_P26 Output Write Enable **/
#define PIOE_PIO_OWER_P26		(1 << 26)
/** PIOE_PIO_OWER_P25 Output Write Enable **/
#define PIOE_PIO_OWER_P25		(1 << 25)
/** PIOE_PIO_OWER_P24 Output Write Enable **/
#define PIOE_PIO_OWER_P24		(1 << 24)
/** PIOE_PIO_OWER_P23 Output Write Enable **/
#define PIOE_PIO_OWER_P23		(1 << 23)
/** PIOE_PIO_OWER_P22 Output Write Enable **/
#define PIOE_PIO_OWER_P22		(1 << 22)
/** PIOE_PIO_OWER_P21 Output Write Enable **/
#define PIOE_PIO_OWER_P21		(1 << 21)
/** PIOE_PIO_OWER_P20 Output Write Enable **/
#define PIOE_PIO_OWER_P20		(1 << 20)
/** PIOE_PIO_OWER_P19 Output Write Enable **/
#define PIOE_PIO_OWER_P19		(1 << 19)
/** PIOE_PIO_OWER_P18 Output Write Enable **/
#define PIOE_PIO_OWER_P18		(1 << 18)
/** PIOE_PIO_OWER_P17 Output Write Enable **/
#define PIOE_PIO_OWER_P17		(1 << 17)
/** PIOE_PIO_OWER_P16 Output Write Enable **/
#define PIOE_PIO_OWER_P16		(1 << 16)
/** PIOE_PIO_OWER_P15 Output Write Enable **/
#define PIOE_PIO_OWER_P15		(1 << 15)
/** PIOE_PIO_OWER_P14 Output Write Enable **/
#define PIOE_PIO_OWER_P14		(1 << 14)
/** PIOE_PIO_OWER_P13 Output Write Enable **/
#define PIOE_PIO_OWER_P13		(1 << 13)
/** PIOE_PIO_OWER_P12 Output Write Enable **/
#define PIOE_PIO_OWER_P12		(1 << 12)
/** PIOE_PIO_OWER_P11 Output Write Enable **/
#define PIOE_PIO_OWER_P11		(1 << 11)
/** PIOE_PIO_OWER_P10 Output Write Enable **/
#define PIOE_PIO_OWER_P10		(1 << 10)
/** PIOE_PIO_OWER_P9 Output Write Enable **/
#define PIOE_PIO_OWER_P9		(1 << 9)
/** PIOE_PIO_OWER_P8 Output Write Enable **/
#define PIOE_PIO_OWER_P8		(1 << 8)
/** PIOE_PIO_OWER_P7 Output Write Enable **/
#define PIOE_PIO_OWER_P7		(1 << 7)
/** PIOE_PIO_OWER_P6 Output Write Enable **/
#define PIOE_PIO_OWER_P6		(1 << 6)
/** PIOE_PIO_OWER_P5 Output Write Enable **/
#define PIOE_PIO_OWER_P5		(1 << 5)
/** PIOE_PIO_OWER_P4 Output Write Enable **/
#define PIOE_PIO_OWER_P4		(1 << 4)
/** PIOE_PIO_OWER_P3 Output Write Enable **/
#define PIOE_PIO_OWER_P3		(1 << 3)
/** PIOE_PIO_OWER_P2 Output Write Enable **/
#define PIOE_PIO_OWER_P2		(1 << 2)
/** PIOE_PIO_OWER_P1 Output Write Enable **/
#define PIOE_PIO_OWER_P1		(1 << 1)
/** PIOE_PIO_OWER_P0 Output Write Enable **/
#define PIOE_PIO_OWER_P0		(1 << 0)

/**@}*/

