grevaillot/svd_tools/headers/ATSAMV71Q21/pioe.h
/** PIOE_PIO_DRIVER_LINE31 Drive of PIO Line 31 **/
#define PIOE_PIO_DRIVER_LINE31		(1 << 31)
/** PIOE_PIO_DRIVER_LINE30 Drive of PIO Line 30 **/
#define PIOE_PIO_DRIVER_LINE30		(1 << 30)
/** PIOE_PIO_DRIVER_LINE29 Drive of PIO Line 29 **/
#define PIOE_PIO_DRIVER_LINE29		(1 << 29)
/** PIOE_PIO_DRIVER_LINE28 Drive of PIO Line 28 **/
#define PIOE_PIO_DRIVER_LINE28		(1 << 28)
/** PIOE_PIO_DRIVER_LINE27 Drive of PIO Line 27 **/
#define PIOE_PIO_DRIVER_LINE27		(1 << 27)
/** PIOE_PIO_DRIVER_LINE26 Drive of PIO Line 26 **/
#define PIOE_PIO_DRIVER_LINE26		(1 << 26)
/** PIOE_PIO_DRIVER_LINE25 Drive of PIO Line 25 **/
#define PIOE_PIO_DRIVER_LINE25		(1 << 25)
/** PIOE_PIO_DRIVER_LINE24 Drive of PIO Line 24 **/
#define PIOE_PIO_DRIVER_LINE24		(1 << 24)
/** PIOE_PIO_DRIVER_LINE23 Drive of PIO Line 23 **/
#define PIOE_PIO_DRIVER_LINE23		(1 << 23)
/** PIOE_PIO_DRIVER_LINE22 Drive of PIO Line 22 **/
#define PIOE_PIO_DRIVER_LINE22		(1 << 22)
/** PIOE_PIO_DRIVER_LINE21 Drive of PIO Line 21 **/
#define PIOE_PIO_DRIVER_LINE21		(1 << 21)
/** PIOE_PIO_DRIVER_LINE20 Drive of PIO Line 20 **/
#define PIOE_PIO_DRIVER_LINE20		(1 << 20)
/** PIOE_PIO_DRIVER_LINE19 Drive of PIO Line 19 **/
#define PIOE_PIO_DRIVER_LINE19		(1 << 19)
/** PIOE_PIO_DRIVER_LINE18 Drive of PIO Line 18 **/
#define PIOE_PIO_DRIVER_LINE18		(1 << 18)
/** PIOE_PIO_DRIVER_LINE17 Drive of PIO Line 17 **/
#define PIOE_PIO_DRIVER_LINE17		(1 << 17)
/** PIOE_PIO_DRIVER_LINE16 Drive of PIO Line 16 **/
#define PIOE_PIO_DRIVER_LINE16		(1 << 16)
/** PIOE_PIO_DRIVER_LINE15 Drive of PIO Line 15 **/
#define PIOE_PIO_DRIVER_LINE15		(1 << 15)
/** PIOE_PIO_DRIVER_LINE14 Drive of PIO Line 14 **/
#define PIOE_PIO_DRIVER_LINE14		(1 << 14)
/** PIOE_PIO_DRIVER_LINE13 Drive of PIO Line 13 **/
#define PIOE_PIO_DRIVER_LINE13		(1 << 13)
/** PIOE_PIO_DRIVER_LINE12 Drive of PIO Line 12 **/
#define PIOE_PIO_DRIVER_LINE12		(1 << 12)
/** PIOE_PIO_DRIVER_LINE11 Drive of PIO Line 11 **/
#define PIOE_PIO_DRIVER_LINE11		(1 << 11)
/** PIOE_PIO_DRIVER_LINE10 Drive of PIO Line 10 **/
#define PIOE_PIO_DRIVER_LINE10		(1 << 10)
/** PIOE_PIO_DRIVER_LINE9 Drive of PIO Line 9 **/
#define PIOE_PIO_DRIVER_LINE9		(1 << 9)
/** PIOE_PIO_DRIVER_LINE8 Drive of PIO Line 8 **/
#define PIOE_PIO_DRIVER_LINE8		(1 << 8)
/** PIOE_PIO_DRIVER_LINE7 Drive of PIO Line 7 **/
#define PIOE_PIO_DRIVER_LINE7		(1 << 7)
/** PIOE_PIO_DRIVER_LINE6 Drive of PIO Line 6 **/
#define PIOE_PIO_DRIVER_LINE6		(1 << 6)
/** PIOE_PIO_DRIVER_LINE5 Drive of PIO Line 5 **/
#define PIOE_PIO_DRIVER_LINE5		(1 << 5)
/** PIOE_PIO_DRIVER_LINE4 Drive of PIO Line 4 **/
#define PIOE_PIO_DRIVER_LINE4		(1 << 4)
/** PIOE_PIO_DRIVER_LINE3 Drive of PIO Line 3 **/
#define PIOE_PIO_DRIVER_LINE3		(1 << 3)
/** PIOE_PIO_DRIVER_LINE2 Drive of PIO Line 2 **/
#define PIOE_PIO_DRIVER_LINE2		(1 << 2)
/** PIOE_PIO_DRIVER_LINE1 Drive of PIO Line 1 **/
#define PIOE_PIO_DRIVER_LINE1		(1 << 1)
/** PIOE_PIO_DRIVER_LINE0 Drive of PIO Line 0 **/
#define PIOE_PIO_DRIVER_LINE0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pcmr PIOPCMR Parallel Capture Mode Register
@{*/

/** PIOE_PIO_PCMR_FRSTS Parallel Capture Mode First Sample **/
#define PIOE_PIO_PCMR_FRSTS		(1 << 11)
/** PIOE_PIO_PCMR_HALFS Parallel Capture Mode Half Sampling **/
#define PIOE_PIO_PCMR_HALFS		(1 << 10)
/** PIOE_PIO_PCMR_ALWYS Parallel Capture Mode Always Sampling **/
#define PIOE_PIO_PCMR_ALWYS		(1 << 9)

#define PIOE_PIO_PCMR_DSIZE_SHIFT		4
#define PIOE_PIO_PCMR_DSIZE_MASK		0x03
/** @defgroup pioe_pio_pcmr_dsize DSIZE Parallel Capture Mode Data Size
@{*/
/**@}*/

/** PIOE_PIO_PCMR_PCEN Parallel Capture Mode Enable **/
#define PIOE_PIO_PCMR_PCEN		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pcier PIOPCIER Parallel Capture Interrupt Enable Register
@{*/

/** PIOE_PIO_PCIER_RXBUFF Reception Buffer Full Interrupt Enable **/
#define PIOE_PIO_PCIER_RXBUFF		(1 << 3)
/** PIOE_PIO_PCIER_ENDRX End of Reception Transfer Interrupt Enable **/
#define PIOE_PIO_PCIER_ENDRX		(1 << 2)
/** PIOE_PIO_PCIER_OVRE Parallel Capture Mode Overrun Error Interrupt Enable **/
#define PIOE_PIO_PCIER_OVRE		(1 << 1)
/** PIOE_PIO_PCIER_DRDY Parallel Capture Mode Data Ready Interrupt Enable **/
#define PIOE_PIO_PCIER_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pcidr PIOPCIDR Parallel Capture Interrupt Disable Register
@{*/

/** PIOE_PIO_PCIDR_RXBUFF Reception Buffer Full Interrupt Disable **/
#define PIOE_PIO_PCIDR_RXBUFF		(1 << 3)
/** PIOE_PIO_PCIDR_ENDRX End of Reception Transfer Interrupt Disable **/
#define PIOE_PIO_PCIDR_ENDRX		(1 << 2)
/** PIOE_PIO_PCIDR_OVRE Parallel Capture Mode Overrun Error Interrupt Disable **/
#define PIOE_PIO_PCIDR_OVRE		(1 << 1)
/** PIOE_PIO_PCIDR_DRDY Parallel Capture Mode Data Ready Interrupt Disable **/
#define PIOE_PIO_PCIDR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pcimr PIOPCIMR Parallel Capture Interrupt Mask Register
@{*/

/** PIOE_PIO_PCIMR_RXBUFF Reception Buffer Full Interrupt Mask **/
#define PIOE_PIO_PCIMR_RXBUFF		(1 << 3)
/** PIOE_PIO_PCIMR_ENDRX End of Reception Transfer Interrupt Mask **/
#define PIOE_PIO_PCIMR_ENDRX		(1 << 2)
/** PIOE_PIO_PCIMR_OVRE Parallel Capture Mode Overrun Error Interrupt Mask **/
#define PIOE_PIO_PCIMR_OVRE		(1 << 1)
/** PIOE_PIO_PCIMR_DRDY Parallel Capture Mode Data Ready Interrupt Mask **/
#define PIOE_PIO_PCIMR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pcisr PIOPCISR Parallel Capture Interrupt Status Register
@{*/

/** PIOE_PIO_PCISR_OVRE Parallel Capture Mode Overrun Error **/
#define PIOE_PIO_PCISR_OVRE		(1 << 1)
/** PIOE_PIO_PCISR_DRDY Parallel Capture Mode Data Ready **/
#define PIOE_PIO_PCISR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pcrhr PIOPCRHR Parallel Capture Reception Holding Register
@{*/


#define PIOE_PIO_PCRHR_RDATA_SHIFT		0
#define PIOE_PIO_PCRHR_RDATA_MASK		0xffffffff
/** @defgroup pioe_pio_pcrhr_rdata RDATA Parallel Capture Mode Reception Data
@{*/
/**@}*/


/**@}*/
